app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        if current_user.nil? || params[:id].to_i != current_user[:id]
          redirect_to new_session_url
          return
        end

        @user = User.find(params[:id])