app/controllers/posts_controller.rb

    def create
        @post = Pub.create(post_params)
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Life is good"], ["url", ""], ["content", "try this "], ["user_id", 6], ["created_at", "2019-09-01 14:57:05.821185"], ["updated_at", "2019-09-01 14:57:05.821185"]]

    def update
        @post = post.find(params[:id])
        if @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "    sic em woof woof\r\nlet's win a natty this year!\r\n  "], ["updated_at", "2019-09-01 15:03:21.573998"], ["id", 4]]

    def authors_only!
        return if current_user.posts.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 4], ["LIMIT", 1]]