app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Random thoughts "], ["description", "Anything goes "], ["moderator_id", 6], ["created_at", "2019-09-01 13:40:43.728213"], ["updated_at", "2019-09-01 13:40:43.728213"]]
---
    def create
        @sub = sub.new(sub_params)

        if @sub.save