app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        if current_user.nil? || params[:id].to_i != current_user[:id]
          redirect_to new_session_url
          return
        end

        @user = User.find(params[:id])