app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bryan"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by(username: username).try(:authenticate, password)